model {
  faster_rcnn {
    num_classes: 15
    image_resizer {
      keep_aspect_ratio_resizer {
        min_dimension: 640
        max_dimension: 800
        pad_to_max_dimension: true
      }
    }
    feature_extractor {
      type: "faster_rcnn_resnet50_keras"
      batch_norm_trainable: true
    }
    first_stage_anchor_generator {
      grid_anchor_generator {
        height_stride: 16
        width_stride: 16
        scales: 0.1
        scales: 0.25
        scales: 0.5
        scales: 1.0
        aspect_ratios: 0.05
        aspect_ratios: 0.1
        aspect_ratios: 2.5
        aspect_ratios: 5.0
        aspect_ratios: 10.0
        aspect_ratios: 20.0
      }
    }
    first_stage_box_predictor_conv_hyperparams {
      op: CONV
      regularizer {
        l2_regularizer {
          weight: 0.0005
        }
      }
      initializer {
        truncated_normal_initializer {
          stddev: 0.01
        }
      }
    }
    first_stage_nms_score_threshold: 0.0
    first_stage_nms_iou_threshold: 0.7
    first_stage_max_proposals: 200
    first_stage_localization_loss_weight: 2.0
    first_stage_objectness_loss_weight: 1.0
    initial_crop_size: 14
    maxpool_kernel_size: 2
    maxpool_stride: 2
    second_stage_box_predictor {
      mask_rcnn_box_predictor {
        fc_hyperparams {
          op: FC
          regularizer {
            l2_regularizer {
              weight: 0.0008
            }
          }
          initializer {
            variance_scaling_initializer {
              factor: 1.0
              uniform: true
              mode: FAN_AVG
            }
          }
        }
        use_dropout: true
        dropout_keep_probability: 0.6
        share_box_across_classes: true
      }
    }
    second_stage_post_processing {
      batch_non_max_suppression {
        score_threshold: 0.0
        iou_threshold: 0.5
        max_detections_per_class: 15
        max_total_detections: 20
      }
      score_converter: SOFTMAX
    }
    second_stage_localization_loss_weight: 2.0
    second_stage_classification_loss_weight: 2.0
    use_matmul_crop_and_resize: true
    clip_anchors_to_image: true
    use_matmul_gather_in_matcher: true
    use_static_balanced_label_sampler: true
    use_static_shapes: true
  }
}
train_config {
  batch_size: 8
  sync_replicas: true
  optimizer {
    adam_optimizer {
      learning_rate {
        manual_step_learning_rate {
          initial_learning_rate: 3e-05
          schedule {
            step: 1000
            learning_rate: 1e-05
          }
          schedule {
            step: 3000
            learning_rate: 3e-06
          }
          schedule {
            step: 5000
            learning_rate: 1e-06
          }
          schedule {
            step: 8000
            learning_rate: 3e-07
          }
        }
      }
    }
    use_moving_average: false
  }
  fine_tune_checkpoint: "Tensorflow/workspace/pre-trained-models/faster_rcnn_resnet50_v1_640x640_coco17_tpu-8/checkpoint/ckpt-0"
  num_steps: 25000
  startup_delay_steps: 0.0
  replicas_to_aggregate: 8
  max_number_of_boxes: 100
  unpad_groundtruth_tensors: false
  fine_tune_checkpoint_type: "detection"
  use_bfloat16: true
  fine_tune_checkpoint_version: V2
}
train_input_reader {
  label_map_path: "Tensorflow/workspace/annotations/label_map.pbtxt"
  tf_record_input_reader {
    input_path: "Tensorflow/workspace/annotations/train.record"
  }
}
eval_config {
  num_visualizations: 200
  visualization_export_dir: "Tensorflow/workspace/annotations"
  metrics_set: "pascal_voc_detection_metrics"
  use_moving_averages: false
  include_metrics_per_category: true
  batch_size: 1
  all_metrics_per_category: true
}
eval_input_reader {
  label_map_path: "Tensorflow/workspace/annotations/label_map.pbtxt"
  shuffle: false
  num_epochs: 1
  tf_record_input_reader {
    input_path: "Tensorflow/workspace/annotations/test.record"
  }
}
